In [122]:
#1 - Leia o CSV 'Filmes'em uma variável chamada df. Digite print(df) na próxima linha veja o que aparece.
import pandas as pd
df = pd.read_csv('Filmes.csv', encoding='UTF-8', sep=',')
print(df)

      id                                       nome  genero     ano  nota_imdb
0      1                                     Avatar  action  2009.0        7.9
1      2                             Jurassic World  action  2015.0        7.3
2      3                               The Avengers  action  2012.0        8.1
3      4                            The Dark Knight  action  2008.0        9.0
4      5  Star Wars: Episode I - The Phantom Menace  action  1999.0        6.6
..   ...                                        ...     ...     ...        ...
215  216                                   Hannibal   drama  2001.0        6.7
216  217                        Catch Me If You Can   drama  2002.0        8.0
217  218                                  Big Daddy   drama  1999.0        6.4
218  219                                      Se7en   drama  1995.0        8.6
219  220                                      Seven   drama  1979.0        6.1

[220 rows x 5 columns]

In [123]:
#2 - Quando carregamos um novo DataFrame de um CSV, queremos saber como ele se parece.
#Se for um DataFrame pequeno, você pode exibi-lo digitando print(df).
#Se for um DataFrame maior, é útil poder inspecionar alguns itens sem precisar examinar o DataFrame inteiro.
# Mostre  as 5 primeiras linhas do DataFrame df.
print(df.head(), "\n")

# Mostre algumas estatísticas para cada coluna
#Estatísticas coluna 'ano' e 'nota_imdb'
print(df.describe(), "\n")

#Estatísticas coluna 'nome'
dfFilmesA = df[df.nome.str[0] == 'A']
print("Quantidade de filmes que começam com a letra \'A\':", len(dfFilmesA.nome))
dfFilmesH = df[df.nome.str[0] == 'H']
print("Quantidade de filmes que começam com a letra \'H\':", len(dfFilmesH.nome))

#Estatísticas coluna 'genero'
print("\nMédia das notas por gênero:", df.groupby('genero').nota_imdb.mean())

  id                                       nome  genero     ano  nota_imdb
0  1                                     Avatar  action  2009.0        7.9
1  2                             Jurassic World  action  2015.0        7.3
2  3                               The Avengers  action  2012.0        8.1
3  4                            The Dark Knight  action  2008.0        9.0
4  5  Star Wars: Episode I - The Phantom Menace  action  1999.0        6.6

               ano   nota_imdb
count   219.000000  219.000000
mean   2002.972603    6.988584
std      11.157306    0.969066
min    1937.000000    4.200000
25%    1999.000000    6.400000
50%    2006.000000    7.100000
75%    2011.000000    7.700000
max    2015.000000    9.000000

Quantidade de filmes que começam com a letra 'A': 15
Quantidade de filmes que começam com a letra 'H': 6

Média das notas por gênero: genero
action     7.396000
comedy     7.119565
drama      7.563333
horror     6.348980
romance    6.709091
Name: nota_imdb, dtype: float64

In [124]:
#Selecionar colunas
#3 - Crie uma variável nomes_filmes que contenha somente os nomes dos filmes
#Depois de criar a variável de o comando print(nomes_filmes)
nomes_filmes = df['nome']
print(nomes_filmes)

0                                         Avatar
1                                 Jurassic World
2                                   The Avengers
3                                The Dark Knight
4      Star Wars: Episode I - The Phantom Menace
                         ...
215                                     Hannibal
216                          Catch Me If You Can
217                                    Big Daddy
218                                        Se7en
219                                        Seven
Name: nome, Length: 220, dtype: object

In [125]:
#Agora, você quer comparar os filmes através de suas notas 
#4 - Crie uma variável filmes_e_notas que contenha somente dos dados das colunas nome e nota_imdb
#Depois de criar a variável de o comando print(filmes_e_notas)
filmes_e_notas = df[['nome', 'nota_imdb']]
print(filmes_e_notas)

                                          nome  nota_imdb
0                                       Avatar        7.9
1                               Jurassic World        7.3
2                                 The Avengers        8.1
3                              The Dark Knight        9.0
4    Star Wars: Episode I - The Phantom Menace        6.6
..                                         ...        ...
215                                   Hannibal        6.7
216                        Catch Me If You Can        8.0
217                                  Big Daddy        6.4
218                                      Se7en        8.6
219                                      Seven        6.1

[220 rows x 2 columns]

In [126]:
#Selecionando linhas
#5 - Escreva um comando que mostre os 10 primeiros registros
filmes_e_notas[0:10]

                                        nome  nota_imdb
0                                     Avatar        7.9
1                             Jurassic World        7.3
2                               The Avengers        8.1
3                            The Dark Knight        9.0
4  Star Wars: Episode I - The Phantom Menace        6.6
5                                  Star Wars        8.7
6                    Avengers: Age of Ultron        7.9
7                      The Dark Knight Rises        8.5
8  Pirates of the Caribbean: Dead Mans Chest        7.3
9                                 Iron Man 3        7.3

In [127]:
#6 - Escreva um comando que mostre os 4 últimos registros do DataFrame
filmes_e_notas[-4:]

                    nome  nota_imdb
216  Catch Me If You Can        8.0
217            Big Daddy        6.4
218                Se7en        8.6
219                Seven        6.1

In [128]:
df2 = pd.DataFrame([
  [1, 'Parafuso de 3 polegadas', 0.5, 0.75],
  [2, 'Prego de duas polegadas', 0.10, 0.25],
  [3, 'Martelo', 3.00, 5.50],
  [4, 'Chave de fenda', 2.50, 3.00]
],
  columns=['id_do_produto', 'produto', 'custo_de_fabricacao', 'preco']
)
df2

   id_do_produto                  produto  custo_de_fabricacao  preco
0              1  Parafuso de 3 polegadas                  0.5   0.75
1              2  Prego de duas polegadas                  0.1   0.25
2              3                  Martelo                  3.0   5.50
3              4           Chave de fenda                  2.5   3.00

In [129]:
#7 - Adiciona ao df2 a coluna margem que é a diferença entre o preço e custo de fabricação
df2['margem'] = df2.preco - df2.custo_de_fabricacao
df2

   id_do_produto                  produto  custo_de_fabricacao  preco  margem
0              1  Parafuso de 3 polegadas                  0.5   0.75    0.25
1              2  Prego de duas polegadas                  0.1   0.25    0.15
2              3                  Martelo                  3.0   5.50    2.50
3              4           Chave de fenda                  2.5   3.00    0.50

In [130]:
#8 - Altere o nome da coluna ID do produto para ID e Produto para Descrição
df2.rename(columns={'id_do_produto' : 'id', 'produto' : 'descricao'}, inplace=True)
df2

   id                descricao  custo_de_fabricacao  preco  margem
0   1  Parafuso de 3 polegadas                  0.5   0.75    0.25
1   2  Prego de duas polegadas                  0.1   0.25    0.15
2   3                  Martelo                  3.0   5.50    2.50
3   4           Chave de fenda                  2.5   3.00    0.50

In [131]:
#Leia o CSV 'olimpíadas'em uma variável chamada df3.
#Examine o DataFrame para entender o conjunto de dados
df3 = pd.read_csv('olimpíadas.csv', encoding='UTF-8', sep=',')
df3
#Este arquivo CSV traz dados relacionados a edições das olimpíadas que ocorreram, separando por ano, edição, cidade de sede, país e delegação.
#Dentre estes dados estão as equipes participantes, e para elas o ID, nome ,idade, altura e peso de cada atleta participante desta.
#Contemplando também o evento que estes realizaram, juntamente da medalha que obtiveram com seu desempenho naquele evento

,ano,edicao,cidade_sede,pais,delegacao,equipe,id_atleta,nome_atleta,sexo,idade,altura,peso,esporte,evento,medalha
0,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,"Athletics Men's 1,500 metres",Gold
1,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,Athletics Men's 800 metres,Gold
2,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Athletics,Athletics Men's Marathon,NaN
3,1896,Summer,Athina,Australia,AUS,Australia/Great Britain,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Tennis,Tennis Men's Doubles,Bronze
4,1896,Summer,Athina,Australia,AUS,Australia,35698,"Edwin Harold ""Teddy"" Flack",M,22.0,NaN,NaN,Tennis,Tennis Men's Singles,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269713,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133071,"Pei Lin ""Audrey"" Yong",F,21.0,156.0,50.0,Sailing,Sailing Women's Windsurfer,NaN
269714,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133346,Yu Mengyu,F,26.0,166.0,50.0,Table Tennis,Table Tennis Women's Singles,NaN
269715,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,133346,Yu Mengyu,F,26.0,166.0,50.0,Table Tennis,Table Tennis Women's Team,NaN
269716,2016,Summer,Rio de Janeiro,NaN,SGP,Singapore,134826,Zhou Yihan,F,22.0,168.0,54.0,Table Tennis,Table Tennis Women's Team,NaN
269717,2016,Summer,Rio de Janeiro,NaN,TUV,Tuvalu,120422,Etimoni Timuani,M,24.0,184.0,72.0,Athletics,Athletics Men's 100 metres,NaN

In [132]:
#9 - Escreva um comando que mostre o nome dos atletas brasileiros com mais de 30 anos e do sexo masculino que participaram
#das olimpíadas a partir de 2012
df3[(df3.pais == 'Brazil') & (df3.idade > 30) & (df3.sexo == 'M')].nome_atleta

12958             Dario Barbosa
12959             Dario Barbosa
12974        Guilherme Paraense
12975        Guilherme Paraense
12976        Guilherme Paraense
                  ...
258089             Pedro Veniss
258090             Pedro Veniss
258103    Daniel Rezende Xavier
258104    Daniel Rezende Xavier
258110        Moacir Zimmermann
Name: nome_atleta, Length: 517, dtype: object

In [133]:
#10 - Crie uma variável media_idade que contenha a média de idade dos atletas brasileiros
#Depois de criar a variável de o comando print(media_idade)
import numpy as np
media_idade = np.mean(df3[df3.pais == 'Brazil'].idade)
print(media_idade)

25.60612460401267

In [134]:
#11 - Escreva um comando que mostre o nome, idade e ano de participação do atleta brasileiro mais velho
#que participou dos jogos olimpícos
df3[df3.idade == df3.idade.max()][['nome_atleta', 'idade', 'ano']]

                  nome_atleta  idade   ano
26877  John Quincy Adams Ward   97.0  1928

In [135]:
#12 - Escreva um comando que mostre o nome, o ano e idade do atleta brasileiro mais jovem a ganhar uma medalha de ouro.
df3[df3.medalha == 'Gold'][['nome_atleta', 'ano', 'idade']].min()

nome_atleta    A. Albert
ano                 1896
idade               13.0
dtype: object

In [136]:
#13 - Crie uma variável total_pais que contenha o total de medalhas por pais
#Depois de criar a variável de o comando print(total_pais) 
total_pais = df3.groupby('pais').medalha.count()
print(total_pais)

pais
Afghanistan                 2
Albania                     0
Algeria                    17
American Samoa              0
Andorra                     0
                           ..
Virgin Islands, British     0
Virgin Islands, US          1
Yemen                       0
Zambia                      2
Zimbabwe                   22
Name: medalha, Length: 205, dtype: int64

In [137]:
#Voltando ao primeiro DataFrame sobre filmes
#14 - Escreva um comando que mostre quais o generos de filmes estão disponíveis no DataFrame.
#Obs: Não é só mostrar a coluna gênero
df.groupby('genero').nome.count()

genero
action     50
comedy     46
drama      30
horror     49
romance    44
Name: nome, dtype: int64

In [138]:
#15 - Escreva um comando que apresente a média das notas dos filmes por ano.
df.groupby('ano').nota_imdb.mean()

ano
1937.0    7.700000
1939.0    8.200000
1965.0    8.000000
1975.0    8.100000
1977.0    8.700000
1978.0    5.700000
1979.0    6.150000
1980.0    8.800000
1982.0    7.400000
1983.0    8.400000
1984.0    7.433333
1985.0    8.500000
1986.0    7.600000
1987.0    5.900000
1988.0    8.000000
1989.0    6.700000
1990.0    7.325000
1991.0    7.450000
1992.0    7.750000
1993.0    6.900000
1994.0    7.775000
1995.0    7.600000
1996.0    6.925000
1997.0    6.487500
1998.0    7.600000
1999.0    6.609091
2000.0    6.728571
2001.0    6.825000
2002.0    6.912500
2003.0    7.014286
2004.0    6.485714
2005.0    6.750000
2006.0    6.712500
2007.0    6.781818
2008.0    7.000000
2009.0    6.678571
2010.0    6.927273
2011.0    6.820000
2012.0    7.166667
2013.0    7.078571
2014.0    7.415385
2015.0    7.028571
Name: nota_imdb, dtype: float64

In [ ]:
#Exerícios parte 2

In [ ]:
#1 - Existem duas lojas de hardware na cidade: Loja A e Loja B. O estoque da Loja A está no DataFrame estoqueA 
#e o estoque da Loja B está no DataFrame estoqueB. Eles decidiram se fundir em uma grande Super Store!
#Combine os estoques da Loja A e da Loja B. Salve os resultados na variável estoqueAeB.
import pandas as pd
estoqueA   = pd.read_csv('estoqueA.csv', encoding='UTF-8', sep=',')
estoqueB   = pd.read_csv('estoqueB.csv', encoding='UTF-8', sep=',')
estoqueAeB = estoqueA.merge(estoqueB)

In [ ]:
#Print a variável estoqueAeB e observe a quantidade de valores NaN
#2 - Substitua os valores NaN por 0
print(estoqueAeB)
semNa = estoqueAeB.fillna(value={'quantidade_estoque_A': 0, 'quantidade_estoque_B': 0})
print("\n", semNa)

        item  quantidade_estoque_A  quantidade_estoque_B
0     hammer                    12                     6
1      nails                   200                   250
2        saw                     6                     6
3  duct tape                   150                   150
4   pvc pipe                    54                    54

         item  quantidade_estoque_A  quantidade_estoque_B
0     hammer                    12                     6
1      nails                   200                   250
2        saw                     6                     6
3  duct tape                   150                   150
4   pvc pipe                    54                    54

In [ ]:
#3 - Selecione as linhas de estoqueAeB onde a quantidade em estoque de um item seja maior que 100. 
semNa[(semNa.quantidade_estoque_A > 100) | (semNa.quantidade_estoque_B > 100)]

        item  quantidade_estoque_A  quantidade_estoque_B
1      nails                   200                   250
3  duct tape                   150                   150

In [ ]:
#4 - Adicione a coluna estoque_total com a soma da quantidade no estoqueA com a quantidade no estoqueB
estoqueAeB['estoque_total'] = estoqueAeB.quantidade_estoque_A + estoqueAeB.quantidade_estoque_B
estoqueAeB

        item  quantidade_estoque_A  quantidade_estoque_B  estoque_total
0     hammer                    12                     6             18
1      nails                   200                   250            450
2        saw                     6                     6             12
3  duct tape                   150                   150            300
4   pvc pipe                    54                    54            108

In [ ]:
#5 - Combine todos os CSVs que começam com a palavra arquivo em um único DataFrame
import glob as gb
arquivos = gb.glob("arquivo*.csv")
dataFrames = [];
for nomeCsv in arquivos:
    df = pd.read_csv(nomeCsv, encoding='UTF-8', sep=',')
    dataFrames.append(df)

dfs = pd.concat(dataFrames)
dfs

   Unnamed: 0          full_name gender_age Fractions Probability       grade
0           0     Barrett Feragh        M14       76%         72%   9th grade
1           1    Llewellyn Keech        M14       83%         87%  12th grade
2           2  Delilah Sowthcote        F16       90%         79%  10th grade
3           3       Terrell Geri        M15       80%         86%  11th grade
4           4     Gram Hallewell        M14       67%         78%  10th grade
..        ...                ...        ...       ...         ...         ...
95         95           Maxi Dew        F16       77%         71%  10th grade
96         96        Jewell Boas        F15       57%         90%  12th grade
97         97       Lebbie Twine        F17       72%         91%  12th grade
98         98      Garek Culbert        M14       64%         80%  11th grade
99         99   Cristine Warboys        F16       74%         74%  12th grade

[900 rows x 6 columns]

In [ ]:
#6 Verique se o DataFrame estudantes possui algum registro duplicado
estudantes = pd.read_csv('estudantes.csv', encoding='UTF-8', sep=',');

In [ ]:
#Inspecione o DataFrame estudantes para conhecer os dados e colunas
#7- A coluna gender_age possui duas informações gênero e idade, divida essa coluna em duas novas, gênero e idade
#Imprima o .head()  para ver como fica o DataFrame após a criação das novas colunas.
genero_idade = estudantes.gender_age.str.split('_')
estudantes['genero'] = genero_idade.str.get(0)
estudantes['idade']  = genero_idade.str.get(1)
estudantes